{
	"Absolute Direction": {
		"title": "Absolute Direction",
		"cost": 1,
		"output_text": "You always know which way is North, no matter the circumstances. The only exception is if you are more than a day's travel inside the Shadowlands.",
		"description": "You possess an almost supernatural sense of direction, and you always know what direction is North, no matter the curcumstances. This ability foes not function if you are more than one day's travel inside the Shadowlands."
	},

	"Allies": {
		"title": "Allies",
		"output_title": "Allies - {name}",
		"cost": "£{influence[cost]} + {devotion[cost]}£",
		"discount": "clan_Crane",
		"output_text": "Ally Name: {name}<br>Influence: {influence[text]}<br>Devotion: {devotion[text]}",
		"description": "You have carefully nurtured social connections. Some of those in your web would go to great lengths to protect you, while others have considerable resources. And some precious few are both. The total cost of this Advantage is determined by how many points you spend on your ally's degree of influence and their devotion to you. Crane characrters may purchase this Advantage for 1 point less than its normal cost.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "name",
				"label_text": "Ally"
			},
			{
				"type": "select",
				"id": "influence",
				"label_text": "Influence",
				"default_option": "Select Influence Level...",
				"options": {
					"1": {
						"text": "Minor (no land or appointments)",
						"cost": 1
					},
					"2": {
						"text": "Moderate (some land or political influence)",
						"cost": 2
					},
					"3": {
						"text": "Major (vast lands or prestigious appointments)",
						"cost": 4
					}
				}
			},
			{
				"type": "select",
				"id": "devotion",
				"label_text": "Devotion",
				"default_option": "Select Devotion Level...",
				"options": {
					"1": {
						"text": "Your ally would go out of their way to help you, but not risk their honor.",
						"cost": 1
					},
					"2": {
						"text": "Your ally would risk their honor to help you, but would do so secretly.",
						"cost": 2
					},
					"3": {
						"text": "Your ally would do anything to aid you, regardless of the cost.",
						"cost": 4
					}
				}
			}
		]
	},

	"Balance": {
		"title": "Balance",
		"cost": 2,
		"description": "You possess an inherent calm and serenity that others have difficulty overcoming when attempting to antagonize or taunt you, and that strengthens you when your honor is tested. When adding your Honor Rank to the total of any roll made to resist Intimidation or Temptation, you add an additional +1k0 to the roll as well.",
		"output_text": "If you add your Honor to any Roll made to resist Intimidation or Temptation, add +1k0 to the roll."
	},

	"Blackmail": {
		"title": "Blackmail",
		"output_title": "Blackmail - {target_name}",
		"cost": "{honor_rank}",
		"discount": "clan_Scorpion",
		"description": "You possess knowledge and proof of a dark secret held by another, and can use that secret to elicit their cooperation in a number of ways. The cost of the Advantage is equal to theh Status Rank of the individual whom you are blackmailing. Using this Advantage too frequently or making grandiose demands mar result in them deciding your death is worth the risk of exposing their secret, no matter what the consequences might be. Scorpion characters may purchase this Advantage for 1 point less than normal.",
		"output_text": "<b>Person Blackmailed:</b> {target_name}<br><b>Blackmail:</b> {blackmail_description}",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "target_name",
				"label_text": "Target's Name"
			},
			{
				"type": "int",
				"id": "honor_rank",
				"label_text": "Target's Honor Rank",
				"max": 10,
				"min": 1
			},
			{
				"type": "text",
				"id": "blackmail_description",
				"label_text": "Blackmail Description (Optional)",
				"optional": true,
				"textbox": true
			}
		]
	},

	"Bland": {
		"title": "Bland",
		"cost": 2,
		"description": "You are extremely unremarkable in every regard, and others have a difficult time recognizing you unless you delibarately draw attention to your identity or affiliations. Whenever someone is making a Lore: Bushido / Awareness roll to determine your Honor Rank, or a Lore: Heraldry / Intelligence roll to determine your identity (based on your Glory Rank), you may voluntarily choose to increase the TN of that roll by 10.",
		"output_text": "Whenever someone is making a Lore: Bushido roll to determine your Honor Rank, or a Lore: Heraldry roll to determine your identity (based on your Glory Rank), you may voluntarily choose to increase the TN of that roll by 10."
	},

	"Blissful Betrothal": {
		"_COMMENT": "Activates other skills and discounts",
		"title": "Blissful Betrothal",
		"cost": 3,
		"description": "Your marriage has been arranged and, much to your delight, you have come to truly love your intended spouse. The social connections you have established as part of your enthusiastic marriage preparations allow you to purchase the following Advantages for two points less each (to a minimum of 1 point): Gentry, Kharmic Tie (with your betrothed only), Social Position, and Wealth.",
		"output_text": "You may purchase the following skills for 2 points less each (to a minimum of 1):<br>Gentry<br>Kharmic Tie (with {betrothed})<br>Social Position<br>Wealth",
		"input": [
			{
				"type": "text",
				"id": "betrothed",
				"label_text": "Name of Betrothed"
			}
		]
	},

	"Blood Of Osano-Wo": {
		"title": "Blood of Osano-Wo",
		"cost": 4,
		"discount": "clan_Crab clan_Mantis",
		"description": "You are descended from a bloodline of Hida Osano-Wo, the Fortune of Fire and Thunder, and his resilience lives on in you. You are immune to any penalties or famage from natural weather confitions, such as winter cold, summer heat, etc. If you suffer damage from a spell that employs natural forces (such as the mighty storm created by Hurricane, or the lightning bolt summoned by Fury of Osano-Wo), reduce the amount of damage you suffer by 1k1. Crab and Mantis characters may purchase this Advantage for 3 points.",
		"output_text": "You are immune to any penalties or damage from natural weather conditions. If you suffer damage from a spell that emplays natural forces (e.g. Hurricane, Fury of Osano-Wo), reduce the amount of damage you suffer by 1k1."
	},

	"Chosen by the Oracles": {
		"title": "Chosen by the Oracles",
		"output_title": "Chosen by the Oracles - {ring_name[text]}",
		"cost": 6,
		"description": "For reasons beyond your understanding, you have caught the notice of one of the Oracles, humans suffused with the divine power of Elemental Dragons. You must select one Ring when you take this Advantage. You gain a bonus of +1k1 to the total of all Ring Rolls using that Ring.",
		"output_text": "You gain a bonus of +1k1 to the total of all {ring_name[text]} Rolls.",
		"allow_multiple": true,
		"input": [
			{
				"type": "select",
				"id": "ring_name",
				"label_text": "Ring",
				"default_option": "Select Ring...",
				"options": {
					"1": {
						"text": "Air Ring"
					},
					"2": {
						"text": "Earth Ring"
					},
					"3": {
						"text": "Fire Ring"
					},
					"4": {
						"text": "Water Ring"
					},
					"5": {
						"text": "Void Ring"
					}
				}
			}
		]
	},

	"Clear Thinker": {
		"title": "Clear Thinker",
		"cost": 3,
		"discount": "clan_Dragon",
		"description": "You possess a sharp mind and keen powers of perception, making it very difficult for others to deceive you. Whenever you make a Contested Roll against someone who is attempting to confuse or manipulate you in any way, you gain a bonus of +1k0 to the total of your roll. Dragon characters may purchase this Advantage for 2 points.",
		"output_text": "Whenever you make a Contested Roll against someone who is attempting to confuse or manipulate you in any way, you gain a bonus of +1k0 to the roll."
	},

	"Crab Hands": {
		"title": "Crab Hands",
		"cost": 3,
		"discount": "clan_Crab class_Bushi",
		"description": "You possess a natural affinity for weapons of all kinds, and can take up even an unfamiliar blade without difficulty in times of stress. Any time that you would be forced to make an Unskilled Roll when using a Weapon Skill, you are instead considered to have 1 rank in that Weapon Skill. Crab and bushi characters may purchase this Advantage for 2 points.",
		"output_text": "When forced to make an Unskilled Roll using a Weapon Skill, you are instead considered to have 1 rank in that Weapon Skill."
	},

	"Crafty": {
		"title": "Crafty",
		"cost": 3,
		"discount": "clan_Scorpion clan_Spider class_Ninja",
		"description": "You have a knack for instinctively knowing how to do things that most people prefer to avoid at all costs. Whenever you are in a situation where you would be forced to make an Unskilled Roll using a Low Skill, you are considered to have 1 rank in the Skill instead. Scorpion, Spider, and Ninja characrters may purchase this Advantage for 2 points.",
		"output_text": "When forced to make an Unskilled Roll using a Low Skill, you are considered to have 1 rank in that skill instead."
	},

	"Dangerous Beauty": {
		"title": "Dangerous Beauty",
		"cost": 3,
		"discount": "clan_Scorpion",
		"description": "You possesss a certain quality that makes you all but irresistible to members of the opposite sex, and they succumb easily to your manipulations. You gain a bonus of +1k0 to the total of all Temptation Skill Rolls made with members of the opposite sex. Scorpion characters may purchase this Advantage for 2 points.",
		"output_text": "You gain a bonus of +1k0 to all Temptation Skill Rolls made against members of the opposite sex."
	},

	"Daredevil": {
		"_COMMENT": "Affects Void Point use",
		"title": "Daredevil",
		"cost": 3,
		"discount": "clan_Mantis",
		"description": "You have a naturual flair for athleticism and a complete lack of self-preservation when it comes to physical danger. Whenever you spend a Void Point to enhance an Athletics Skill Roll, you gain a bonus of +3k1 to the total of the roll instead of the normal +1k1. Mantis characters may purchase this Advantage for 2 points.",
		"output_text": "Whenever you spend a Void Point to enhance an Athletics Skill Roll, you gain a bonus of +3k1 instead of the normal +1k1."
	},

	"Dark Paragon": {
		"title": "Dark Paragon",
		"output_title": "Dark Paragon ({precept[text]})",
		"cost": "5",
		"discount": "clan_Spider",
		"description": "You have mastered one of the precepts of Shourido, the dark code that forms an antithesis of Bushido. Once per session, you may voluntarily sacrifice 5 points of Honor as a Free Action in order to affect a particular type of roll according to your chosen precept, and gain bonus +5 to the total of that roll. If you do not have 5 points of Honor to spend in this manner, you may spend a Void Point instead. Spider character may purchase this Advantage for 4 points.",
		"output_text": "Precept: {precept[text]}<br>Once per session, you may voluntarily sacrifice 5 points of Honor (or 1 Void Point, if you do not have enough Honor) to gain the following bonus:<br>{precept[hovertext]}",
		"allow_multiple": true,
		"input": [
			{
				"type": "select",
				"id": "precept",
				"label_text": "Precept",
				"default_option": "Select a Precept...",
				"options": {
					"1": {
						"text": "Control",
						"hovertext": "Re-roll a Social Skill Roll, with a +5 bonus."
					},
					"2": {
						"text": "Determination",
						"hovertext": "Negate all TN/Wound penalties on one Skill or Spell Casting roll."
					},
					"3": {
						"text": "Insight",
						"hovertext": "Re-roll a roll that used the Awareness Trait, with a +5 bonus."
					},
					"4": {
						"text": "Knowledge",
						"hovertext": "Re-roll a roll that used the Intelligence Trait, with a +5 bonus."
					},
					"5": {
						"text": "Perfection",
						"hovertext": "Cause any one die of your choice on a Skill Roll to explode."
					},
					"6": {
						"text": "Strength",
						"hovertext": "Re-roll a Damage Roll, with a +5 bonus."
					},
					"7": {
						"text": "Will",
						"hovertext": "Negate 10 Wounds at the moment they are suffered."
					}
				}
			}
		]
	},

	"Darling Of The Court": {
		"title": "Darling Of The Court",
		"output_title": "Darling Of The Court ({court})",
		"cost": 2,
		"discount": "class_Courtier",
		"description": "During a recent court session, you did something that gained the notice of the host, resulting in an instant increase in your importance with all those in attendance. Select one court, such as the court of Kyuden Bayushi, or the court of the Okura District in Toshi Ranbo, etc. When in attendance at this court, your Status is effectively on rank higher, but only while court is in session. Courtier characters may purchase this Advantage for 1 point. You may take this Advantage multiple times for different courts, but only once for each particular court.",
		"output_text": "Court: {court}<br>While this court is in session, and you are in attendance at this court, your Status is effectively 1 rank higher.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "court",
				"label_text": "Court",
				"placeholder": "Name of the Court"
			}
		]
	},

	"Elemental Blessing": {
		"_COMMENT": "Affects Trait upgrade costs",
		"title": "Elemental Blessing",
		"output_title": "Elemental Blessing ({ring_name})",
		"cost": 4,
		"discount": "clan_Phoenix",
		"description": "You are much beloved by the kami of a particular element, although you know not why that might be. As a result, the cost of increasing the Traits associated with one particular Ring, chosen when this Advantage is purchased, is decreased by 1. For example, if you choose Earth when you purchase this Advantage, the cost of increasing Stamina and Willpower is reduced by 1 Experience Point ever time you increase them. Void may not be chosen for this Advantage. Phoenix characters may purchase this Advantage for 3 points.",
		"output_text": "All trait increases for Traits associated with your {ring_name[text]} cost 1 Experience Point less.",
		"input": [
			{
				"type": "select",
				"id": "ring_name",
				"label_text": "Ring",
				"default_option": "Select Ring...",
				"options": {
					"1": {
						"text": "Air Ring"
					},
					"2": {
						"text": "Earth Ring"
					},
					"3": {
						"text": "Fire Ring"
					},
					"4": {
						"text": "Water Ring"
					}
				}
			}
		]
	},

	"Enlightened": {
		"_COMMENT": "Affects Void Ring upgrade cost",
		"title": "Enlightened",
		"cost": 4,
		"discount": "clan_Dragon class_Monk",
		"description": "Your spiritual journey toward complete harmony with the universe as a whole has begun to reach its destination. In addition to whatever storyline effects your GM may choose to bestow on you, you also find it easier to enhance your connection to the Void. When you are using Experience Points to increase your Void Ring, the total cost is decreased by 2 points each time. Dragon and monk characters may purchase this advantage for 5 points.",
		"output_text": "When upgrading your Void Ring, the cost for each Rank is decreased by 2 Experience Points from its normal cost."
	},

	"Fame": {
		"_COMMENT": "Adds Glory",
		"title": "Fame",
		"cost": 3,
		"description": "As a result of your actions, there are many in the Empire who know your name. You gain +1 Glory Rank.",
		"output_text": "You have +1 Glory Rank."
	},

	"Forbidden Knowledge": {
		"_COMMENT": "Adds a skill",
		"title": "Forbidden Knowledge",
		"output_title": "Forbidden Knowledge ({knowledge_title})",
		"cost": 5,
		"description": "There is a subject about which you possess considerable knowledge and insight. The problem is that this subject is forbidden, and considered grossly socially inappropriate if not outright illegal. Anyone who discovers your expertise in this area might rightly wonder how you came upon it. The benefits of the Advantage vary depending upon the nature of the information, and players should discuss with their GM how this Advantage will work.",
		"output_text": "{knowledge_title}<br>{knowledge_description}",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "knowledge_title",
				"label_text": "Knowledge"
			},
			{
				"type": "text",
				"id": "knowledge_description",
				"label_text": "Details",
				"optional": true,
				"placeholder": "(Optional)"
			},
			{
				"type": "checkbox",
				"id": "gain_skill",
				"label_text": "Include Skill Gain?",
				"start_checked": false
			},
			{
				"type": "dropdown",
				"id": "skill_choice",
				"dropdown_type": "skills",
				"label_text": "Skill",
				"dependency": "{gain_skill} == true"
			}
		]
	},

	"Friendly Kami": {
		"_COMMENT": "Would be good if we could introduce custom restrictions based on Elemental Deficiencies",
		"title": "Friendly Kami",
		"output_title": "Friendly Kami ({element_choice})",
		"cost": 5,
		"restriction": "class_Shugenja",
		"description": "A particular kami has befriended you, and stays in your vicinity at all times. Choose one element when this Advantage is purchased. You gain a bonus of +1k1 to the total of all Spell Casting Rolls made to cast Sense, Commune or Summon with regard to that Element only. Only shugenja may purchase this Advantage. You may not select this Advantage for an Element in which you are Deficient.",
		"output_text": "You gain a bonus of +1k1 to all Spell Casting Rolls made to cast Sense, Commune, or Summon with regard to the Element of {element_choice[text]}",
		"input": [
			{
				"type": "select",
				"id": "element_choice",
				"label_text": "Element",
				"default_option": "Select an Element...",
				"options": {
					"1": {
						"text": "Air"
					},
					"2": {
						"text": "Earth"
					},
					"3": {
						"text": "Fire"
					},
					"4": {
						"text": "Water"
					},
					"5": {
						"text": "Void"
					}
				}
			}
		]
	},

	"Friend of the Brotherhood": {
		"_COMMENT": "Affects learning Kiho",
		"title": "Friend of the Brotherhood",
		"cost": 5,
		"discount": "clan_Dragon",
		"description": "You have studied among your allies at the Brotherhood of Shinsei, and as a result you understand your place in the universe slightly better than most. You may purchase Kiho as though you are a Monk of the Brotherhood of Shinsei, instead of paying a higher cost. You must still meet all other normal restrictions on learning Kiho. Only characters from Monk or Shugenja Schools (and not Monk characters from the Brotherhood of Shinsei) may purchase this Advantage. Dragon characters may purchase this Advantage for 4 points.",
		"output_text": "You may purchase Kiho as though you are a Monk of the Brotherhood of Shinsei, instead of paying a higher cost. You must still meet all other normal restrictions on learning Kiho."
	},

	"Friend Of The Elements": {
		"title": "Friend Of The Elements",
		"output_title": "Friend Of The Elements ({ring_name[text]})",
		"cost": 4,
		"discount": "class_Shugenja",
		"description": "The spirits of a certain Element swirl about you at all times, lending their aid when possible even though you are likely unaware of their presence. Choose a Ring when this Advantage is purchased. Whenever you make a Trait Roll with either Trait associated with that Ring, you gain a Free Raise. Shugenja characters may purchase this Advantage for 3 points.",
		"output_text": "Ring: {ring_name[text]}<br>Whenever you make a Trait Roll with your {ring_name[value]} trait, you gain a Free Raise.",
		"input": [
			{
				"type": "select",
				"id": "ring_name",
				"label_text": "Ring",
				"default_option": "Select a Ring...",
				"options": {
					"1": {
						"text": "Air Ring",
						"value": "either your Reflexes or Awareness"
					},
					"2": {
						"text": "Earth Ring",
						"value": "either your Stamina or Willpower"
					},
					"3": {
						"text": "Fire Ring",
						"value": "either your Agility or Intelligence"
					},
					"4": {
						"text": "Water Ring",
						"value": "either your Strength or Perception"
					},
					"5": {
						"text": "Void Ring",
						"value": "your Void"
					}
				}
			}
		]
	},

	"Gaijin Gear": {
		"_COMMENT": "Adds an item",
		"title": "Gaijin Gear",
		"output_title": "Gaijin Gear - {item_name}",
		"cost": 5,
		"discount": "clan_Mantis clan_Unicorn",
		"description": "You possess a single piece of equipment that is gaijin in origin, constructed somewhere beyond the boundaries of the Emerald Empire. It may be a weapon from one of the many warrior cultires around Rokugan, such as the Senpet Empire, the overseas kingdoms of Merenae and Thrane, the barbarian Yobanjin tribes to the north, or even the distant Yodotai Empire far to the northwest. In this case simply establish a comparable weapon from Rokugan and use its mechanics, but the item will require its own unique Weapon Skill to utilize it. Non-weapon options include such buzarre objects as compasses, spyglasses, magnifying glasses, scissors, etc. Mantis and Unicorn characters may purchase this Advantage for 4 points.",
		"output_text": "You have a piece of Gaijin Gear - {item_name}<br>{item_description}",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "item_name",
				"label_text": "Item Name"
			},
			{
				"type": "text",
				"id": "item_description",
				"label_text": "Description",
				"placeholder": "(Optional)",
				"optional": true
			},
			{
				"type": "checkbox",
				"id": "weapon",
				"label_text": "Item is a weapon?",
				"start_checked": false
			},
			{
				"type": "dropdown",
				"id": "weapon_type",
				"dropdown_type": "weapons",
				"label_text": "Rokugani-weapon Analog",
				"dependency": "{weapon} == true"
			}
		]
	},

	"Gentry": {
		"title": "Gentry",
		"output_title": "Gentry - {holding_name}",
		"cost": "({shared}) ? {individual_cost} : {holding_size[cost]}",
		"discount": "adv_BlissfulBetrothal",
		"description": "In the manner of all Samurai, you have been given a duty to oversee that which ultimately belongs to the Emperor. In your case, however, your charge is significantly larger than most ever achieve. The number of points assigned to this Advantage determines the size of the holding you have been assigned to oversee. Multiple characters can combine points in this advantage in order to oversee a larger holding. Characters assigned to oversee a holding are responsible for defending it, administrating it, and ensuring that all taxes are paid to all responsible parties. This can be the basis for an entire campaign.",
		"output_text": "Holding Name: {holding_name}<br>Holding Size: {holding_size[text]}<br>Shared: {shared}",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "holding_name",
				"label_text": "Holding Name"
			},
			{
				"type": "select",
				"id": "holding_size",
				"label_text": "Holding Size",
				"default_option": "Select Holding Size...",
				"options": {
					"1": {
						"text": "Village",
						"cost": 8
					},
					"2": {
						"text": "Large Village",
						"cost": 15
					},
					"3": {
						"text": "Unique Holding (Sake works, Falconry, etc.)",
						"cost": 18
					},
					"4": {
						"text": "Town",
						"cost": 20
					},
					"5": {
						"text": "City",
						"cost": 25
					},
					"6": {
						"text": "Province",
						"cost": 30
					}
				}
			},
			{
				"type": "checkbox",
				"id": "shared",
				"label_text": "Shared Holding?",
				"start_checked": false
			},
			{
				"type": "int",
				"id": "individual_cost",
				"label_text": "Individual Cost",
				"min": 1,
				"max": 30,
				"dependency": "{shared} == true"
			}
		]
	},

	"Great Destiny": {
		"title": "Great Destiny",
		"cost": 5,
		"description": "The kharmic cycle has some great purpose in store for you, and the Celestial Order will conspire to keep you alive, no matter what, until your destiny can be fulfilled. Once per session, when you suffer Wounds that would kill you, you are reduced to a single Wound remaining instead. This will only happen once per session, as there are limits to the extent that the Heavens will intervene in mortal affairs.",
		"output_text": "Once per session, when you suffer Wounds that would kill you, you are reduced to a single Wound remaining instead."
	},

	"Great Potential": {
		"_COMMENT": "Affects Raise Limit",
		"title": "Great Potential",
		"output_title": "Great Potential ({skill_name})",
		"cost": 5,
		"description": "Within you lies the potential to excel at one particular endeavor, perhaps more so than any other living soul in the Empire. Select any one Skill when you purchase this Advantage. When you make Raises on a Skill Roll using that Skill, your raises are limited by your rank in that Skill instead of your Void RIng. If your Void Ring is higher, however, you may use that as a measure for your Raises if you so choose.",
		"output_text": "When you make Raises on {skill_name} Skill Rolls, your Raises are limited by your rank in that Skill instead of your Void Ring (unless your Void Ring is higher).",
		"allow_multiple": true,
		"input": [
			{
				"type": "dropdown",
				"id": "skill_name",
				"dropdown_type": "skills",
				"label_text": "Chosen Skill"
			}
		]
	},

	"Hands Of Stone": {
		"_COMMENT": "Can affect Damage Rolls, if we're going to do those automatically",
		"title": "Hands Of Stone",
		"cost": 6,
		"discount": "class_Monk",
		"description": "Some have a natural talent for unarmed combat, and you are one such individual. The Damage Rolls for your unarmed attacks are increased by +0k1. Monk characters may purchase this Advantage for 5 points.",
		"output_text": "The Damage Rolls for your unarmed attacks are increased by +0k1."
	},

	"Heart Of Vengeance": {
		"title": "Heart Of Vengeance",
		"output_title": "Heart Of Vengeance ({faction_name})",
		"cost": 5,
		"discount": "clan_Spider",
		"description": "One Clan has earned your eternal, undying hatred, and nothing will ever quench your rage. Select one Clan or other faction (such as the Brotherhood of Shinsei or one of the Imperial Families) when purchasing this Advantage. You gain a bonus of +1k1 to the total of any Contested Roll made against a member of the Clan/faction. Spider characters may purchase this Advantage for 4 points.",
		"output_text": "You gain a bonus of +1k1 to the total of any Contested Roll made against a member of the {faction_name}.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "faction_name",
				"label_text": "Clan/Faction Name",
				"placeholder": "e.g. Crane Clan"
			}
		]
	},

	"Hero Of The People": {
		"title": "Hero Of The People",
		"cost": 2,
		"description": "Although your reputation among your fellow samurai may not be any better than that of the next individual, your actions have garnered the adoration of the common folk. When meeting citizens of Rokugan who are not members of the samurai caste, the TN for them to recognize you, as determined by your Glory Rank, is lowered by 10.",
		"output_text": "The TN for citizens of Rokugan who are not of the samurai caste to recognise you (as determined by your Glory Rank) is lowered by 10."
	},

	"Higher Purpose": {
		"title": "Higher Purpose",
		"cost": 3,
		"description": "There is some greater purpose to which you have devoted your life. This is not a simple matter, but some grand work that will take years or perhaps even the whole of your life to accomplish. Whatever this goal is, during any session in which you and the GM agree you have made demonstrable progress toward it, you gain one additional Experience Point.",
		"output_text": "Higher Purpose: {higher_purpose}<br>During any session in which you and the GM agree you have made demonstrable progress towards this goal, you gain 1 additional Experience Point (to be entered manually).",
		"input": [
			{
				"type": "text",
				"id": "higher_purpose",
				"label_text": "Purpose"
			}
		]
	},

	"Imperial Spouse": {
		"_COMMENT": "Affects Status",
		"title": "Imperial Spouse",
		"cost": 5,
		"description": "Through a careful exchange of favors and resources, your family arranged for you to be married to a minor member of an Imperial Family. Your spouse was not of high enough station to warrant you taking an Imperial name, but there are benefits all the same. You gain +0.5 Status Ranks, and gain a bonus of +1k1 to the total of all Social Skill Rolls made with members of Imperial Families.",
		"output_text": "You gain 5 points of Status, and gain a bonus of +1k1 to the total of all Social Skill rolls made with members of the Imperial families."
	},

	"Inari's Blessing": {
		"title": "Inari's Blessing",
		"cost": 3,
		"description": "The Fortune of Rice is a lesser Fortune, but nevertheless is among the most revered entities throughout the whole of Rokugan, particularly by the common people of the Empire. When fasting or deprived of food, you do not suffer from the normal inability to regain Void Points, although other penalties apply as normal.",
		"output_text": "When fasting or deprived of food, you do not suffer from the normal inability to regain Void Points, although other penalties apply as normal."
	},

	"Inheritance": {
		"_COMMENT": "Adds an item",
		"title": "Inheritance",
		"output_title": "Inheritance - {item_name}",
		"cost": 5,
		"description": "When you received your gempukku ceremony, your family honored you with an heirloom of your ancestors. It is among your most precious possessions, and you would die before you allowed it to be harmed or brought dishonor to it. You possess one item in addition to the normal starting equipment provided by your School. Whenever you make a Skill Roll using this item (such as a Perform: Biwa roll with a biwa, a Games: Go roll with a go set, or a Kenjutsu roll with a katana) you gain a bonus of +1k1 to the roll. This bonus does not apply to any attack or damage rolls, only Skill Rolls made for non-combat purposes (i.e. rolls made outside of a skirmish). Players and GMs may agree to allow a more powerful or unique item to be inherited for a higher Experience Point cost. This should be made under a custom Advantage.",
		"output_text": "You inherited {item_name}. You would die before allowing it to be harmed or have dishonor brought to it.<br>Whenever you make a Skill Roll (for non-combat purposes only) using this item, you gain a bonus +1k1 to the roll.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "item_name",
				"label_text": "Inherited Item",
				"placeholder": "(e.g. 'my grandfather's Go set', or 'a uniquely decorated katana')"
			}
		]
	},

	"Inner Gift": {
		"title": "Inner Gift",
		"output_title": "Inner Gift ({inner_gift_choice})",
		"cost": 7,
		"description": "You possess a mysterious gift that even shugenja cannot fully understand. Monks describe individuals such as yourself as existing in a unique state of harmony with the universe, but then they say that sort of thing a lot. Your gift may be a manifestation of the kami, perhaps an indicator of spirit ancestry, or any of a number of different theories. The exact nature of an Inner Gift should be discussed with the GM before taking this Advantage. You may choose one of the gifts provided, or write your own.",
		"output_text": "£({inner_gift_choice} == 6) ? 'Gift: {custom_gift_title}<br>{custom_gift_description}' : '{inner_gift_choice[text]}<br>{inner_gift_choice[hovertext]}'£",
		"allow_multiple": true,
		"input": [
			{
				"type": "select",
				"id": "inner_gift_choice",
				"label_text": "Inner Gift",
				"default_option": "Select an effect...",
				"options": {
					"1": {
						"text": "Animal Ken",
						"hovertext": "You may instictively sense the mood of animals. Many animals regard you as friendly."
					},
					"2": {
						"text": "Empathy",
						"hovertext": "You gain a bonus of +1k1 to Courtier rolls made to determine another's feelings or desires."
					},
					"3": {
						"text": "Foresight",
						"hovertext": "You are difficult to surprise, and gain a bonus of +1k0 to the total of all Initiative rolls."
					},
					"4": {
						"text": "Lesser Prophecy",
						"hovertext": "You sometimes have vague dreams of the future, such as a bloody knife before a murder."
					},
					"5": {
						"text": "Spirit Touch",
						"hovertext": "You may make an Awareness roll (TN 15) to see the last person to touch an object that you are touching."
					},
					"6": {
						"text": "Custom Gift",
						"hovertext": "Create a custom Inner Gift"
					}
				}
			},
			{
				"type": "text",
				"id": "custom_gift_title",
				"label_text": "Title of Inner Gift",
				"dependency": "{inner_gift_choice} == 6"
			},
			{
				"type": "text",
				"id": "custom_gift_description",
				"label_text": "Description",
				"dependency": "{inner_gift_choice} == 6"
			}
		]
	},

	"Irreproachable": {
		"title": "Irreproachable",
		"cost": 2,
		"discount": "clan_Imperial",
		"description": "You have a soul of virtue that is beyond reproach, and others find it difficult if not impossible to lead you into dishonorable behaviour. When making a Contested Roll where the other party is using the Temptation Skill, you gaina bonus of +1k0 to your roll. Imperial characters may purchase this Advantage for 1 point.",
		"output_text": "When making a Contested Roll where the other party is using the Temptation Skill, you gain a bonus of +1k0 to your roll."
	},

	"Ishiken-Do": {
		"_COMMENT": "Allows Void Spells - probably coding on Spell end, not here",
		"title": "Ishiken-Do",
		"cost": 8,
		"discount": "clan_Phoenix_2",
		"restriction": "class_Shugenja",
		"description": "You have that rarest of gifts, the ability to commune with the Void itself. This gift is similar in many respects to the ability to speak to the kami, save that there are no naturally occurring kami of the Void; the Void itself is a living thing, both everything and nothing all at once. You may cast Void spells. Only shugenja may take this Advantage, and without this Advantage a character cannot cast Void spells. Phoenix characters may purchase this Advantage for 6 points.",
		"output_text": "You may cast Void spells."
	},

	"Kharmic Tie": {
		"title": "Kharmic Tie",
		"output_title": "Kharmis Tie - {name_of_bonded}",
		"cost": "{rank}",
		"discount": "adv_BlissfulBetrothal",
		"description": "Your destiny is not yours alone, but is bonded to that of another in some fundamental way. You may have been close to this other person during a previous life, or perhaps your destiny in this life will yet be entwined in theirs in some essential manner. Select one person when purchasing this Advantage. For each point spent on this Advantage, once per session you gain a bonus of +1k1 to the total of all attack rolls made when fighting for or protecting the person to whom you are bonded.",
		"output_text": "Kharmically bonded to: {name_of_bonded}<br>You gain a bonus of +1k1 to the total of all attack rolls made when fighting for or protecting this person, {rank} times per session.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "name_of_bonded",
				"label_text": "Bonded Person"
			},
			{
				"type": "int",
				"id": "rank",
				"label_text": "Ranks",
				"max": 5,
				"min": 1
			}
		] 
	},

	"Kharmic Tie - Blissful Betrothal": {
		"_COMMENT": "Need option to dynamically show this",
		"title": "Kharmic Tie - Blissful Betrothal",
		"cost": "{rank}",
		"description": "Your destiny is not yours alone, but is bonded to that of your betrothed spouse. You may have been close to this other person during a previous life, or perhaps your destiny in this life will yet be entwined in theirs in some essential manner. For each point spent on this Advantage, once per session you gain a bonus of +1k1 to the total of all attack rolls made when fighting for or protecting your spouse.",
		"output_text": "Kharmically bonded to your betrothed.<br>You gain a bonus of +1k1 to the total of all attack rolls made when fighting for or protecting this person, {rank} times per session.",
		"input": [
			{
				"type": "int",
				"id": "rank",
				"label_text": "Ranks",
				"max": 5,
				"min": 1
			}
		] 
	},

	"Languages": {
		"title": "Languages",
		"output_title": "Languages - {language_name}",
		"cost": "{language_type[cost]}",
		"description": "The Empire has only one language with two dialects. The world around Rokugan, however, has a wide variety of nations and cultures, each with their own language. For 1 point, you may learn one human language from any surrounding culture, including but not limited to: the Yobanjin dialect, Senpet, Yodotai, Mekham, Merenae, Rhuumal, Thrane, etc. A non-human language, such as the Nezumi or Naga languages, required 3 points and confers only an ability to understand the language and a limited ability to express very basic concepts verbally.",
		"output_text": "{language_name[text]}<br>{language_type[text]}: {language_type[hovertext]}",
		"input": [
			{
				"type": "select",
				"id": "language_type",
				"label_text": "Type of Language",
				"default_option": "Select language type...",
				"options": {
					"1": {
						"text": "Human Language",
						"cost": 1,
						"hovertext": "You are fluent in the language."
					},
					"2": {
						"text": "Non-human Language",
						"cost": 3,
						"hovertext": "You can understand the language, but have a limited ability to express basic concepts verbally."
					}
				}
			},
			{
				"type": "text",
				"id": "language_name",
				"label_text": "Language"
			}
		]
	},

	"Large": {
		"title": "Large",
		"cost": 4,
		"discount": "clan_Crab",
		"description": "You are significantly larger than the average Rokugani, ranging in height from 6'0 to 6'3 in height. You gain a bonus of +1k0 to the total of all Damage Rolls for any large melee weapon. Crab characters may purchase this Advantage for 3 points.",
		"output_text": "You gain a bonus +1k0 to the total of all Damage Rolls for any Large melee weapon."
	},

	"Leadership": {
		"title": "Leadership",
		"cost": 6,
		"discount": "clan_Lion",
		"description": "You have an innate knack for leading and inspiring others in battle. Once per Round during the Reactions stage, you may add your School Rank plus 1k1 to the Initiative Score of one ally in a skirmish. This bonus lasts until the Reactions stage of the following round. An individual may only benefit from one use of this Advantage per Round. Lion characters may purchase this Advantage for 5 points.",
		"output_text": "Once per Round, during the Reactions stage, you may add (your School Rank + 1k1) to the Initiative Score of one ally in a skirmish. This bonus lasts until the Reactions stage of the following round. An individual may only benefit from one use of this Advantage per Round."
	},

	"Luck": {
		"title": "Luck",
		"output_title": "Luck {rank}",
		"cost": "{rank[cost]}",
		"description": "Fortune favors the mortal man. A number of times per session equal to your rank in this Advantage, you may choose to immediately re-roll any one roll you make, keeping the higher of the two results.",
		"output_text": "You may choose to immediately re-roll any one roll you make, keeping the higher of the two results. Can be used {rank} time(s) per session.",
		"input":[
			{
				"type": "select",
				"id": "rank",
				"label_text": "Rank",
				"required": true,
				"default_option": "Select Luck Rank...",
				"options": {
					"1": {
						"text": "1",
						"cost": "3"
					},
					"2": {
						"text": "2",
						"cost": "6"
					},
					"3": {
						"text": "3",
						"cost": "9"
					}
				}
			}
		]
	},

	"Magic Resistance": {
		"title": "Magic Resistance",
		"output_title": "Magic Resistance {rank}",
		"cost": "{rank} * 2",
		"description": "For reasons beyond your understanding, the kami are reluctant to involve themselves with you in any way. For each rank you possess in this Advantage, all elemental spells targeting you have the TN of the Spell Casting Roll made to enact it increased by +3. Maho, gaijin, and non-human forms of magic are not affected by this Advantage.",
		"output_text": "All elemental spells targeting you have the TN of the Spell Casting Roll made to enact it increased by +£3*{rank}£. Maho, Gaijin, and non-human forms of magic are not affected.",
		"allow_multiple": false,
		"input": [
			{
				"type": "int",
				"id": "rank",
				"label_text": "Rank",
				"max": 3,
				"min": 1
			}
		]
	},

	"Multiple Schools": {
		"_COMMENT": "Not implemented at all yet",
		"title": "Multiple Schools",
		"cost": 10,
		"description": "THIS HAS NOT BEEN IMPLEMENTED, DO NOT TAKE THIS ADVANTAGE. Just a placeholder here to remind me to do it at some point.",
		"output_text": "Placeholder Output_text"
	},

	"Paragon": {
		"title": "Paragon",
		"output_title": "Paragon ({tenet})",
		"cost": 7,
		"discount": "clan_Lion",
		"description": "You exemplify the code of Bushido, and have taken one particular tenet to heart and made it your way of life. In addition to the Tenet-specific benefit, any time that your gain Honor for exhibiting the virtue that you have selected, you gain an additional +1 Honor. Lion characters may purchase this Advantage for 6 points.",
		"output_text": "Tenet: {tenet[text]}<br>{tenet[hovertext]}<br>You also gain +1 Honor any time you gain Honor for exhibiting {tenet[text]}.",
		"input": [
			{
				"type": "select",
				"id": "tenet",
				"label_text": "Tenet",
				"default_option": "Select a Tenet...",
				"options": {
					"1": {
						"text": "Compassion",
						"hovertext": "Any time you spend a Void Point to improve a roll made to directly help those lower than you in the Celestial Order, you gain +2k2 instead of +1k1."
					},
					"2": {
						"text": "Courage",
						"hovertext": "You add a bonus of +1k1 to the total of any roll made to resist Intimidation or to overcome Fear effects."
					},
					"3": {
						"text": "Courtesy",
						"hovertext": "Any time you make an Etiquette roll to avoid an embarrassment or breach of honor, you add +2k0 to the roll."
					},
					"4": {
						"text": "Duty",
						"hovertext": "You may spend a Void Point on any Skill Roll or Spell Casting Roll to negate all TN penalties for that roll, including Wound penalties."
					},
					"5": {
						"text": "Honesty",
						"hovertext": "On any Sincerity (Honesty) roll, you add a bonus of +1k1. You may add this bonus even if you do not possess the Emphasis, but it would apply in the situation at hand."
					},
					"6": {
						"text": "Honor",
						"hovertext": "You may add twice your Honor Rank to all rolls to resist Temptation or Intimidation rolls, instead of the normal bonus."
					},
					"7": {
						"text": "Sincerity",
						"hovertext": "You may add a bonus of +2k0 to all Contested Rolls using Sincerity."
					}
				}
			}
		]
	},

	"Perceived Honor": {
		"title": "Perceived Honor",
		"output_title": "Perceived Honor ({rank})",
		"cost": "{rank}*2",
		"description": "Others find it difficult to perceive your true nature, a fact that benefits you in concealing your sometimes questionable actions. For each rank you possess in this Advantage, your Honor is considered one full rank higher for the purpose of all attempts to discern it. Anyone attempting to roll Lore: Bushido to determine your Honor Rank will determine the false rank instead of your actual Honor.",
		"output_text": "Your Honor is considered {rank} rank(s) higher for the purpose of all attempts to discern it. Anyone attempting to roll Lore: Bushido to determine your Honor Rank will determine the false rank instead of your actual Honor.",
		"input": [
			{
				"type": "int",
				"id": "rank",
				"label_text": "Ranks",
				"max": 10,
				"min": 1
			}
		]
	},

	"Precise Memory": {
		"title": "Precise Memory",
		"cost": 3,
		"description": "You have an incredible ability to recall exactly things you have seen or heard. In any situation where you need to remember something exactly the way it was, whether the wording of something you read or the details of a person's physical appearance, you add a bonus of +1k1 to your Intelligence Trait Roll.",
		"output_text": "In any situation where you need to remember something exactly the way it was, you add a bonus of +1k1 to your Intelligence Trait Roll."
	},

	"Prodigy": {
		"title": "Prodigy",
		"cost": 12,
		"description": "You are a marvel of the dojo, and your sensei believe that you will accomplish incredible things in your lifetime. Whenever you make a School Skill Roll, you gain a bonus of +1k0 to the roll.",
		"output_text": "Whenever you make a School Skill Roll, you gain a bonus of +1k0 to the roll."
	},

	"Quick": {
		"_COMMENT": "Affects Initiative",
		"title": "Quick",
		"cost": 6, 
		"discount": "class_Ninja",
		"description": "You can react quickly to others, seizing advantage where previously there had been none. If you did not act first during a Combat Round, during the Reactions Stage of combat you may add your Reflexes Trait to the total of your Initiative Score for all subsequent rounds of this skirmish. This may be done each Round that you did not act first. Ninja characters may purchase this Advantage for 5 points.",
		"output_text": "If you did not act first during a Combat Round, during the Reactions Stage of combat you may add your Reflexes Trait to the total of your Initiative Score for all subsequent rounds of this skirmish. This may be done each Round that you did not act first."
	},

	"Quick Healer": {
		"title": "Quick Healer",
		"cost": 3,
		"description": "Your body mends incredibly quickly, allowing you to recover from even devastating wounds with amazing speed. For the purposes of recovering Wounds, your Stamina is considered to be 2 ranks higher.",
		"output_text": "For the purposes of recovering Wounds, your Stamina is considered to be 2 ranks higher."
	},

	"Read Lips": {
		"title": "Read Lips",
		"cost": 4,
		"discount": "class_Courtier",
		"description": "Either through natural ability or incredible patience and practice, you have the ability to understand what others are saying even if you cannot hear them, simply by observing how their lips move. When you are in a situation where others are speaking and you cannot hear them, you can understand what they are saying by making a Perception Trait Roll against TN (15 + 5 for every 20 feet away from you the speakers are). Courtier characters may purchase this Advantage for 3 points.",
		"output_text": "When you are in a situation where others are speaking and you cannot hear them, you can understand what they are saying by making a Perception Trait Roll against TN (15 + 5 for every 20 feet away from you the speakers are)."
	},

	"Sacred Weapon": {
		"_COMMENT": "Would be good if we could automatically restrict it to your clan",
		"title": "Sacred Weapon",
		"output_title": "Sacred Weapon ({weapon})",
		"cost": "{weapon[cost]}",
		"description": "You possess a special weapon created by the master weaponsmiths of your Clan, and considered to be an icon of all who bear the mon of your Clan.",
		"output_text": "Weapon: {weapon[text]}<br>{weapon[hovertext]}",
		"input": [
			{
				"type": "select",
				"id": "weapon",
				"label_text": "Clan/Weapon",
				"default_option": "Select Clan/Weapon...",
				"options": {
					"1": {
						"text": "Crab / Kaiu Blade",
						"cost": 6,
						"hovertext": "3k3 Katana; Unbreakable; -2 to target's Reduction"
					},
					"2": {
						"text": "Crane / Kakita Blade",
						"cost": 5,
						"hovertext": "4k2 Katana; May re-roll damage once per Iaijutsu duel"
					},
					"3": {
						"text": "Dragon / Twin Sister Blades",
						"cost": 3,
						"hovertext": "Diasho; +5 to the TN of all Disarm Maneuvers against you"
					},
					"4": {
						"text": "Lion / Akodo Blade",
						"cost": 6,
						"hovertext": "4k2 Katana; Honor Rank considered at +1 while carried"
					},
					"5": {
						"text": "Mantis / Storm Kama (pair)",
						"cost": 6,
						"hovertext": "2k2 Kama; +1k0 to attack rolls when wielding both"
					},
					"6": {
						"text": "Phoenix / Inquisitor's Strike",
						"cost": 6,
						"hovertext": "3k2 Wakizashi; Considered jade against targets with Taint"
					},
					"7": {
						"text": "Scorpion / Shosuro Blade",
						"cost": 5,
						"hovertext": "4k2 Katana; Add +5 to TN to resist poisons applied to blade"
					},
					"8": {
						"text": "Spider / Black Steel Blade",
						"cost": 6,
						"hovertext": "4k2 Katana; Any exploding Damage dice require target to make an Earth Ring Roll (TN 15) or gain 1 point of Shadowlands Taint"
					},
					"9": {
						"text": "Unicorn / Moto Scimitar",
						"cost": 6,
						"hovertext": "3k3 Scimitar; +3 to Damage Rolls made while on horseback"
					}
				}
			}
		]
	},

	"Sacrosanct": {
		"title": "Sacrosanct",
		"cost": 4,
		"discount": "clan_Imperial",
		"description": "Because of some great service you or perhaps your parents performed on behalf of the Emperor, the Son of Heaven has placed you under his protection. You may not purchase this Advantage unless you possess an Honor Rank of 6 or higher. So long as your HOnor does not drop below 6.0, no one of Honor Rank 5 or higher may attack you unless you attack them first; their rigid code of honor simply will not allow them to blatantly go against the Emperor's wishes. Willingly entered duesl ignore the effects of this Advantage. Imperial characters may purchase this Advantage for 3 points.",
		"output_text": "As long as your Honor does not drop below 6.0, no one of Honor Rank 5 or higher may attack you unless you attack them first. Willingly entered duels ignore the effects of this Advantage."
	},

	"Sage": {
		"title": "Sage",
		"cost": 4,
		"discount": "clan_Phoenix class_Shugenja",
		"description": "You have a love of learning, and have accumulated a staggering amount of information during the course of your lifetime. Whenever you would be forced to make an Unskilled Roll when using a Lore Skill, you instead are considered to have 1 rank in that Skill. Phoenix and Shugenja characters may purchase this Advantage for 3 points.",
		"output_text": "Whenever you are forced to make an Unskilled Roll when using a Lore Skill, you instead are considered to have 1 rank in that Skill."
	},

	"Sensation": {
		"title": "Sensation",
		"cost": 3,
		"description": "You are capable of enrapturing the crowd, no matter the circumstances. Whenver you would be required to make an Unskilled Roll using a Perform Skill, you are considered to have 1 rank in that skill.",
		"output_text": "Whenever you would be required to make an Unskilled Roll using a Perform Skill, you are considered to have 1 rank in that skill."
	},

	"Servant": {
		"_COMMENT": "Unfinished. Additional customisation required to allow for adding custom amounts of skills to servants.",
		"title": "Servant",
		"output_title": "Servant - {servant_name}",
		"cost": 5,
		"discount": "{servant_type[discount]}",
		"description": "A servant has been assigned to you by your family, or possibly one whose help you purchased with your own resources in order to make life a little bit easier. You may have a maximum number of servants equal to twice your Status Rank. Different kinds of servants have different useful abilities and can more easily be supplied by different Clans. Typically, a servant has all Traits at rank 2 and a single Skill at rank 3. You may add additional Skill Ranks or Emphases to a servant at the time the Advantage is purchased by paying 3 additional points per Skill Rank or Emphasis.",
		"input": [
			{
				"type": "text",
				"id": "servant_name",
				"label_text": "Name",
				"placeholder": "(Optional)",
				"optional": true
			},
			{
				"type": "select",
				"id": "servant_type",
				"label_text": "Servant Type",
				"default_option": "Select Servant Type...",
				"options": {
					"1": {
						"text": "Artisan",
						"hovertext": "One Artisan Skill at rank 3",
						"discount": "clan_Crane_2"
					},
					"2": {
						"text": "Attendant",
						"hovertext": "Etiquette (Conversation) 3",
						"discount": "clan_Scorpion_2"
					},
					"3": {
						"text": "Budoka",
						"hovertext": "One Weapon Skill at rank 3",
						"discount": "clan_Lion_2"
					},
					"4": {
						"text": "Craftsman",
						"hovertext": "One Craft Skill at rank 3",
						"discount": "clan_Dragon_2"
					},
					"5": {
						"text": "Eta Attendant",
						"hovertext": "Lore: Anatomy 3",
						"discount": "clan_Crab_2"
					},
					"6": {
						"text": "Groom",
						"hovertext": "Animal Handling (Horses) 3",
						"discount": "clan_Unicorn_2"
					},
					"7": {
						"text": "Merchant",
						"hovertext": "Commerce (Appraisal) 3",
						"discount": "clan_Mantis_2"
					},
					"8": {
						"text": "Scribe",
						"hovertext": "One Lore Skill at rank 3",
						"discount": "clan_Phoenix_2"
					},
					"9": {
						"text": "Sohei",
						"hovertext": "Jiujutsu 3",
						"discount": "clan_Spider_2"
					}
				}
			},
			{
				"type": "dropdown",
				"id": "artisan_skill",
				"dropdown_type": "skills_artisan",
				"label_text": "Artisan Skill",
				"dependency": "{servant_type} == 1"
			},
			{
				"type": "dropdown",
				"id": "weapon_skill",
				"dropdown_type": "skills_weapons",
				"label_text": "Weapon Skill",
				"dependency": "{servant_type} == 3"
			},
			{
				"type": "dropdown",
				"id": "craft_skill",
				"dropdown_type": "skills_craft",
				"label_text": "Craft Skill",
				"dependency": "{servant_type} == 4"
			},
			{
				"type": "dropdown",
				"id": "lore_skill",
				"dropdown_type": "skills_lore",
				"label_text": "Lore Skill",
				"dependency": "{servant_type} == 8"
			}
		]
	},

	"Seven Fortune's Blessing": {
		"title": "Seven Fortunes Blessing",
		"output_title": "Seven Fortunes Blessing ({fortune[fortune]})",
		"cost": "{fortune[cost]}",
		"discount": "{fortune[discount]}",
		"description": "One of the Seven Fortunes, the most powerful of all the Fortunes, has taken notice of you and showered you with his or her blessings. These can be powerful bonuses, but sometimes come with expectations. The Fortunes are both fickle and wrathful, after all. The Clans listed after each blessing may purchase that Advantage for 1 point less than its normal cost.",
		"output_text": "{fortune[output_text]}",
		"allow_multiple": true,
		"input": [
			{
				"type": "select",
				"id": "fortune",
				"label_text": "Fortune",
				"default_option": "Select Fortune...",
				"options": {
					"1": {
						"text": "Benten's Blessing - Fortune of Romantic Love",
						"fortune": "Benten",
						"cost": 4,
						"hovertext": "When you attempt to persuade someone, regardless of circumstances, gain +0k1 to the total of the Social Skill roll in question. This bonus only applies to persuasion, not coercion.",
						"output_text": "{fortune[hovertext]}",
						"discount": "clan_Crane"
					},
					"2": {
						"text": "Bishamon's Blessing - Fortune of Strength",
						"fortune": "Bishamon",
						"cost": 5,
						"hovertext": "When you declare and make 3 successful raises on an attack roll for the purpose of Increased Damage Maneuver, you gain one additional Raise. Free Raises do not count towards activating this effect. You also gain +1k0 to the total of any Strength Trait Rolls.",
						"output_text": "{fortune[hovertext]}",
						"discount": "clan_Crab clan_Lion"
					},
					"3": {
						"text": "Daikoku's Blessing - Fortune of Wealth",
						"fortune": "Daikoku",
						"cost": 4,
						"hovertext": "You gain a bonus +1k1 to the total of all Commerce Skill Rolls.",
						"output_text": "{fortune[hovertext]}",
						"discount": "clan_Mantis"
					},
					"4": {
						"text": "Ebisu's Blessing - Fortune of Honest Work",
						"fortune": "Ebisu",
						"cost": 4,
						"hovertext": "You gain a bonus of +1k1 to the total of all Social Skill Rolls made with citizens of Rokugan who are not members of the Samurai caste.",
						"output_text": "{fortune[hovertext]}",
						"discount": "clan_Unicorn"
					},
					"5": {
						"text": "Fukurokujin's Blessing - Fortune of Wisdom",
						"fortune": "Fukurokujin",
						"cost": 4,
						"hovertext": "Select one Lore Skill when you purchase this Advantage. Whenever you make a Skill Roll using that Skill, you gain a bonus +1k1 to the total of that roll.",
						"output_text": "Whenever you make a {lore_skill} Roll, you gain a bonus +1k1 to the total of that roll.",
						"discount": "clan_Dragon clan_Phoenix"
					},
					"6": {
						"text": "Hotei's Blessing - Fortune of Contentment",
						"fortune": "Hotei",
						"cost": 4,
						"hovertext": "Whenever an effect of any sort, either a Spell, Advantage, Technique, or other effect, would cause you to lose Void Points, the instigator of the effect must first defeat you in a Contested Void Roll. If the effect already calls for a Contested Roll of some kind, your roll is instead increased by +10.",
						"output_text": "{fortune[hovertext]}",
						"discount": ""
					},
					"7": {
						"text": "Jurojin's Blessing - Fortune of Longevity",
						"fortune": "Jurojin",
						"cost": 4,
						"hovertext": "Whenever you are rolling to resist the effects of a disease or poison, you gain a bonus of +2k0 to the total of the roll.",
						"output_text": "{fortune[hovertext]}",
						"discount": "clan_Scorpion"
					}
				}
			},
			{
				"type": "dropdown",
				"id": "lore_skill",
				"dropdown_type": "skills_lore",
				"label_text": "Lore Skill",
				"dependency": "{fortune} == 5"
			}
		]
	},

	"Silent": {
		"title": "Silent",
		"cost": 3,
		"discount": "class_Ninja",
		"description": "You have a natural talent for moving silently at all times. You add +1k0 to the total of all Stealth rolls. Ninja characters may purchase this Advantage for 2 points.",
		"output_text": "You add +1k0 to the total of all Stealth rolls."
	},

	"Social Position": {
		"_COMMENT": "Affects Status",
		"title": "Social Position",
		"cost": 6,
		"description": "You have received an illustrious social appointment, whether through your own accomplishments or purely because of political reasons. You gain +1 Status Rank.",
		"output_text": "You gain +1 Status Rank."
	},

	"Soul Of Artistry": {
		"title": "Soul Of Artistry",
		"output_title": "Soul Of Artistry ({creativity_type[text]})",
		"cost": 4,
		"discount": "clan_Crane class_Courtier",
		"description": "Your soul soars with the spirit of creativity. Choose either Artisan Skills or Craft Skills when purchasing thie Advantage. Any time that you would be required to make an Unskilled Roll using a Skill of the chosen type, you are considered to have 1 rank in that Skill. Crane and courtier characters may purchase this Advantage for 3 points.",
		"output_text": "Any time you are required to make an Unskilled Roll for a {creativity_type[text]} Skill, you are considered to have 1 rank in that Skill.",
		"input": [
			{
				"type": "select",
				"id": "creativity_type",
				"label_text": "Specialisation",
				"default_option": "Choose Artisan or Craft skills...",
				"options": {
					"1": {
						"text": "Artisan"
					},
					"2": {
						"text": "Craft"
					}
				}
			}
		]
	},

	"Strength Of The Earth": {
		"_COMMENT": "Affects Wound Penalties",
		"title": "Strength Of The Earth",
		"cost": 3,
		"discount": "class_Bushi",
		"description": "In your soul can be found the spirit of the mountains and the strength of stone. You can overcome injuries that would cripple other men. The TN penalties you suffer from Wound Ranks are reduced by 3. Bushi characters may purchase this Advantage for 2 points.",
		"output_text": "The TN penalties you suffer from Wound Ranks are reduced by 3."
	},

	"Tactician": {
		"title": "Tactician",
		"cost": 4,
		"discount": "clan_Lion class_Bushi",
		"description": "You have a mind well suited to the ebb and flow of battle. When making a roll on the Mass Battle Table, you may increase or dercease your result by 5. Lion and bushi characters may purchase this Advantage for 3 points.",
		"output_text": "When making a roll on the Mass Battle Table, you may increase of decrease your result by 5."
	},

	"Touch Of The Spirit Realms": {
		"title": "Touch Of The Spirit Realms",
		"output_title": "Touch Of The Spirit Realms ({realm[text]})",
		"cost": "{realm[cost]}",
		"discount": "class_Shugenja",
		"description": "Somehow, a fragment of the essence of a spirit realm is present in your soul, and suffuses everything you do. Shugenja characters may pruchase thie Advantage for 4 points.",
		"output_text": "{realm[text]}<br>{realm[output_text]}",
		"input": [
			{
				"type": "select",
				"id": "realm",
				"label_text": "Realm",
				"default_option": "Select a Spirit Realm...",
				"options": {
					"1": {
						"text": "Chikushudo",
						"hovertext": "You gain a +1k1 on all Animal Handling rolls.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"2": {
						"text": "Gaki-do",
						"hovertext": "When you resolve an attack that kills an opponent, you immediately regain 5 Wounds.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"3": {
						"text": "Jigoku",
						"hovertext": "You may add your Taint Rank to any attack roll and any Skill roll or Trait roll that uses a Physical Trait. If you are Lost, you add twice your Taint Rank.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"4": {
						"text": "Maigo No Musha",
						"hovertext": "When you are awarded Glory in an amount greater than 3 points, you receive 1 additional point.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"5": {
						"text": "Meido",
						"hovertext": "You gain a bonus of +2k0 to Contested Rolls versus attempts to manipulate you in social interractions, such as use of the Courtier Skill.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"6": {
						"text": "Sakkaku",
						"hovertext": "You gain a bonus of +1k1 on Sincerity (Deceit) rolls.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"7": {
						"text": "Tengoku",
						"hovertext": "You gain a bonus of +2k0 on Earth Ring Rolls made to resist the Shadowlands Taint.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					},
					"8": {
						"text": "Toshigoku",
						"hovertext": "When making a Move Action to get into range to attack an opponent, the distance of your move is increased by 5 feet.",
						"cost": 8,
						"output_text": "{realm[hovertext]}"
					},
					"9": {
						"text": "Yomi",
						"hovertext": "Select one School Skill. You gain a bonus of +1k0 on all Skill Rolls made using that Skill.",
						"cost": 7,
						"output_text": "You gain a bonus of +1k0 on all {skill_choice} rolls."
					},
					"10": {
						"text": "Yume-Do",
						"hovertext": "You can recover all expended Void Points with only 4 hours of rest, rather than the normal full night of 8 hours of rest.",
						"cost": 5,
						"output_text": "{realm[hovertext]}"
					}
				}
			},
			{
				"type": "dropdown",
				"id": "skill_choice",
				"dropdown_type": "skills",
				"dropdown_restrict": "school",
				"label_text": "Chosen Skill",
				"dependency": "{realm} == 9"
			}
		]
	},

	"Virtuous": {
		"_COMMENT": "Affects Honor Rank",
		"title": "Virtuous",
		"cost": 3,
		"description": "You embrace virtue in your every thought and aciton. You possess one additional rank of Honor above your normal starting value (as determined by your School).",
		"output_text": "+1 Honor Rank"
	},

	"Voice": {
		"title": "Voice",
		"cost": 3,
		"description": "You have a voice that others find pleasing in virtually every respect. You gain a bonus of +1k1 on any Perform Skill Roll that utilizes your voice, such as Perfom: Singing or Perform: Oratory.",
		"output_text": "You gain a bonus of +1k1 on any Perform Skill Roll that utilizes your voice, such as Perfom: Singing or Perform: Oratory."
	},

	"Wary": {
		"title": "Wary",
		"cost": 3,
		"description": "You are constantly on alert, always looking out for the unexpected. When rolling Investigation (Notice) against Stealth (Ambush) to detect an ambush, you add +1k1 to your roll.",
		"output_text": "When rolling Investigation (Notice) against Stealth (Ambush) to detect an ambush, you add +1k1 to your roll."
	},

	"Way Of The Land": {
		"title": "Way Of The Land",
		"output_title": "Way Of The Land ({region})",
		"cost": 2,
		"discount": "clan_Unicorn",
		"description": "You are intimately familiar with a particular region, having traveled it extensively to the point that you know it as well as the interior of your own house. Select the lands of one family, a major city, or some other reasonably sized region. While you are within that region, it is not possible for you to get lost, and you know the location of any available resources to be found there. Unicorn characters may purchase this Advantage for 1 point.",
		"output_text": "Region: {region}<br>While within this region, it is not possible for you to get lost, and you know the location of any available resources to be found there.",
		"allow_multiple": true,
		"input": [
			{
				"type": "text",
				"id": "region",
				"label_text": "Region"
			}
		]
	},

	"Wealthy": {
		"_COMMENT": "Affects Koku",
		"title": "Wealthy",
		"output_title": "Wealthy {rank}",
		"cost": "{rank}",
		"discount": "clan_Crane clan_Unicorn clan_Imperial",
		"description": "Your branch of the family is particularly wealthy, and they have granted you additional resources in order to facilitate your fulfillment of your duty. For each point spent on this Advantage, you gain 2 additional Koku, to be added to the amount in your School outfit. Crane, Unicorn, and Imperial characters may purchase this Advantage for 1 point less off its total cost.",
		"output_text": "You receive a one-off payment of £{rank} * 2£ additional Koku.",
		"input": [
			{
				"type": "int",
				"id": "rank",
				"label_text": "Ranks",
				"min": 1
			}
		]
	}

}